'''
元组(tuple)和list很像，不过是用小括号()的形式，元组中元素一旦确定不可更改。
'''
#两种方式定义元组
#创建只含一个元素的元组时，一定要在后面加一个逗号，不然只会创建元素1
a = (1, 2, 3);print(a)
b = 1, 2, 3 ;print(b)
print(id(a),id(b))

'''
Python中，如多个变量用半角逗号隔开，则默认将多个变量按tuple形式组织起来。
因此Python中两个变量的互换可以这样写：
'''
x,y = 1,2;print((x,y))
x,y = y,x;print(x,y)

'''元组与列表取值方式相同，常用函数如下：'''
#tuple.count(x)      计算x在tuple中出现的次数
#tuple.index(x)      计算第一个x元素的位置

#修改元组
tuple6 = (1,2,3,4,5)
#tuple6[0] = 100    报错，元组（内存地址）不能变，但元素可变
tuple7 = (1,2,3,4,[5,6,7])
print(tuple7)
tuple7[-1][0] = 500
print(tuple7)

#删除元组
tuple8 = (1,2,3)
del tuple8
#print(tuple8)   已删除 会报错

#元组的操作
t7 = (1,2,3)
t8 = (4,5,6)
t9 = t7 + t8
print(t9)
print(t7,t8)

#元组重复
t10 = (1,2,3)
print(t10 * 3)

#判断元素是否在元组中
t11 = (1,2,3)
print(1 in t11)

#元组的截取
#格式：元组名[开始下标：结束下标]
#从开始下标开始截取，截取到结束下标之前
t12 = (1,2,3,4,5,6,7,8,9)
print(t12[1:7])
print(t12[3:])
print(t12[:7])

#二维元组：元素为一维元组的元组
t13 = ((1,2,3),(4,5,6),(7,8,9))
print(t13[1][1])

#元组的方法
t14 = (1,2,3,4,5)

#len()    返回元组中元素的个数
t14 = (1,2,3,4,5)
print(len(t14))

#max()      返回元组中的最大值
#min()      返回元组中的最小值
print(max((5,6,7,8,9)))
print(min((5,6,7,8,9)))

#tuple()    将列表转换为元组
list = [1,2,3,4,5]
t15 = tuple(list)
print(t15,type(t15))

#元组的遍历
for i in (1,2,3,4,5) :
    print(i)